benchmarks/result1.log
1         Threads
50        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         3735.11          ---          ---         1.27189         1.20700         2.38300         7.77500       287.72 
Gets        37342.67         6.67     37336.01         1.21050         1.15100         2.30300         7.48700      1454.77 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      41077.78         6.67     37336.01         1.21609         1.15100         2.30300         7.51900      1742.49 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.295        0.000
SET       0.791        5.000
SET       0.879       10.000
SET       0.935       15.000
SET       0.983       20.000
SET       1.023       25.000
SET       1.063       30.000
SET       1.095       35.000
SET       1.135       40.000
SET       1.167       45.000
SET       1.207       50.000
SET       1.223       52.500
SET       1.247       55.000
SET       1.271       57.500
SET       1.287       60.000
SET       1.311       62.500
SET       1.335       65.000
SET       1.367       67.500
SET       1.391       70.000
SET       1.423       72.500
SET       1.455       75.000
SET       1.471       76.250
SET       1.495       77.500
SET       1.511       78.750
SET       1.527       80.000
SET       1.551       81.250
SET       1.575       82.500
SET       1.591       83.750
SET       1.615       85.000
SET       1.647       86.250
SET       1.671       87.500
SET       1.687       88.125
SET       1.703       88.750
SET       1.719       89.375
SET       1.735       90.000
SET       1.751       90.625
SET       1.767       91.250
SET       1.791       91.875
SET       1.807       92.500
SET       1.831       93.125
SET       1.863       93.750
SET       1.871       94.062
SET       1.887       94.375
SET       1.903       94.688
SET       1.919       95.000
SET       1.935       95.312
SET       1.951       95.625
SET       1.967       95.938
SET       1.991       96.250
SET       2.015       96.562
SET       2.039       96.875
SET       2.063       97.031
SET       2.079       97.188
SET       2.095       97.344
SET       2.111       97.500
SET       2.127       97.656
SET       2.143       97.812
SET       2.175       97.969
SET       2.191       98.125
SET       2.223       98.281
SET       2.255       98.438
SET       2.271       98.516
SET       2.287       98.594
SET       2.303       98.672
SET       2.319       98.750
SET       2.335       98.828
SET       2.367       98.906
SET       2.383       98.984
SET       2.399       99.062
SET       2.431       99.141
SET       2.463       99.219
SET       2.479       99.258
SET       2.495       99.297
SET       2.527       99.336
SET       2.543       99.375
SET       2.559       99.414
SET       2.591       99.453
SET       2.623       99.492
SET       2.671       99.531
SET       2.719       99.570
SET       2.751       99.609
SET       2.767       99.629
SET       2.799       99.648
SET       2.831       99.668
SET       2.863       99.688
SET       2.895       99.707
SET       2.943       99.727
SET       3.007       99.746
SET       3.103       99.766
SET       3.295       99.785
SET       3.567       99.805
SET       3.743       99.814
SET       4.015       99.824
SET       4.319       99.834
SET       4.895       99.844
SET       5.663       99.854
SET       6.239       99.863
SET       6.719       99.873
SET       7.199       99.883
SET       7.583       99.893
SET       7.839       99.902
SET       7.935       99.907
SET       8.031       99.912
SET       8.255       99.917
SET       8.383       99.922
SET       8.511       99.927
SET       8.639       99.932
SET       8.767       99.937
SET       8.895       99.941
SET       9.087       99.946
SET       9.279       99.951
SET       9.343       99.954
SET       9.343       99.956
SET       9.471       99.958
SET       9.471       99.961
SET       9.791       99.963
SET       9.791       99.966
SET       9.983       99.968
SET      10.111       99.971
SET      10.239       99.973
SET      10.751       99.976
SET      10.943       99.977
SET      11.135       99.978
SET      11.263       99.979
SET      11.327       99.980
SET      11.519       99.982
SET      11.711       99.983
SET      12.479       99.984
SET      12.735       99.985
SET      12.927       99.987
SET      12.991       99.988
SET      13.119       99.988
SET      13.119       99.989
SET      13.119       99.990
SET      13.183       99.990
SET      13.183       99.991
SET      13.247       99.991
SET      13.439       99.992
SET      13.439       99.993
SET      13.631       99.993
SET      14.591       99.994
SET      14.591       99.994
SET      14.591       99.995
SET      14.847       99.995
SET      14.847       99.995
SET      14.847       99.995
SET      15.167       99.996
SET      15.167       99.996
SET      15.167       99.996
SET      15.295       99.997
SET      15.295       99.997
SET      15.295       99.997
[...]
SET      15.679       99.997
SET      15.679       99.998
SET      15.679       99.998
SET      15.679       99.998
[...]
SET      15.935       99.998
SET      15.935       99.998
SET      15.935       99.999
SET      15.935       99.999
SET      15.935       99.999
[...]
SET      17.279       99.999
SET      17.279      100.000
---
GET       0.223        0.000
GET       0.743        5.000
GET       0.839       10.000
GET       0.895       15.000
GET       0.943       20.000
GET       0.975       25.000
GET       1.015       30.000
GET       1.047       35.000
GET       1.079       40.000
GET       1.119       45.000
GET       1.151       50.000
GET       1.167       52.500
GET       1.183       55.000
GET       1.207       57.500
GET       1.223       60.000
GET       1.247       62.500
GET       1.271       65.000
GET       1.295       67.500
GET       1.319       70.000
GET       1.351       72.500
GET       1.375       75.000
GET       1.399       76.250
GET       1.415       77.500
GET       1.431       78.750
GET       1.447       80.000
GET       1.471       81.250
GET       1.487       82.500
GET       1.511       83.750
GET       1.535       85.000
GET       1.559       86.250
GET       1.583       87.500
GET       1.599       88.125
GET       1.615       88.750
GET       1.631       89.375
GET       1.647       90.000
GET       1.663       90.625
GET       1.679       91.250
GET       1.703       91.875
GET       1.719       92.500
GET       1.743       93.125
GET       1.767       93.750
GET       1.783       94.062
GET       1.791       94.375
GET       1.807       94.688
GET       1.823       95.000
GET       1.839       95.312
GET       1.855       95.625
GET       1.879       95.938
GET       1.895       96.250
GET       1.919       96.562
GET       1.951       96.875
GET       1.959       97.031
GET       1.975       97.188
GET       1.991       97.344
GET       2.007       97.500
GET       2.023       97.656
GET       2.047       97.812
GET       2.079       97.969
GET       2.095       98.125
GET       2.127       98.281
GET       2.159       98.438
GET       2.175       98.516
GET       2.191       98.594
GET       2.207       98.672
GET       2.223       98.750
GET       2.239       98.828
GET       2.271       98.906
GET       2.287       98.984
GET       2.319       99.062
GET       2.351       99.141
GET       2.383       99.219
GET       2.399       99.258
GET       2.415       99.297
GET       2.447       99.336
GET       2.463       99.375
GET       2.495       99.414
GET       2.511       99.453
GET       2.543       99.492
GET       2.591       99.531
GET       2.639       99.570
GET       2.687       99.609
GET       2.703       99.629
GET       2.735       99.648
GET       2.783       99.668
GET       2.815       99.688
GET       2.863       99.707
GET       2.943       99.727
GET       3.039       99.746
GET       3.167       99.766
GET       3.391       99.785
GET       3.775       99.805
GET       4.079       99.814
GET       4.447       99.824
GET       4.767       99.834
GET       5.215       99.844
GET       5.631       99.854
GET       6.047       99.863
GET       6.463       99.873
GET       6.847       99.883
GET       7.199       99.893
GET       7.551       99.902
GET       7.711       99.907
GET       7.903       99.912
GET       8.063       99.917
GET       8.255       99.922
GET       8.447       99.927
GET       8.639       99.932
GET       8.767       99.937
GET       8.959       99.941
GET       9.087       99.946
GET       9.279       99.951
GET       9.407       99.954
GET       9.471       99.956
GET       9.535       99.958
GET       9.663       99.961
GET       9.791       99.963
GET       9.919       99.966
GET      10.047       99.968
GET      10.239       99.971
GET      10.431       99.973
GET      10.687       99.976
GET      10.879       99.977
GET      11.007       99.978
GET      11.263       99.979
GET      11.519       99.980
GET      11.711       99.982
GET      11.967       99.983
GET      12.095       99.984
GET      12.287       99.985
GET      12.479       99.987
GET      12.671       99.988
GET      12.735       99.988
GET      12.799       99.989
GET      12.927       99.990
GET      12.991       99.990
GET      13.183       99.991
GET      13.247       99.991
GET      13.311       99.992
GET      13.375       99.993
GET      13.439       99.993
GET      13.631       99.994
GET      13.759       99.994
GET      13.759       99.995
GET      13.887       99.995
GET      14.015       99.995
GET      14.143       99.995
GET      14.207       99.996
GET      14.399       99.996
GET      14.399       99.996
GET      14.591       99.997
GET      14.719       99.997
GET      14.847       99.997
GET      14.975       99.997
GET      14.975       99.997
GET      14.975       99.998
GET      15.231       99.998
GET      15.359       99.998
GET      15.423       99.998
GET      15.551       99.998
GET      15.615       99.998
GET      15.679       99.998
GET      15.679       99.999
GET      15.743       99.999
GET      15.935       99.999
GET      15.935       99.999
GET      15.935       99.999
[...]
GET      15.999       99.999
GET      16.191       99.999
GET      16.255       99.999
GET      16.255       99.999
GET      16.319       99.999
GET      16.319       99.999
GET      16.319       99.999
[...]
GET      16.511       99.999
GET      16.511      100.000
GET      16.511      100.000
GET      16.639      100.000
GET      16.639      100.000
GET      16.639      100.000
GET      16.895      100.000
GET      16.895      100.000
GET      16.895      100.000
[...]
GET      17.279      100.000
GET      17.279      100.000
GET      17.279      100.000
[...]
GET      17.535      100.000
GET      17.535      100.000
GET      17.535      100.000
[...]
GET      17.791      100.000
GET      17.791      100.000
---
WAIT      0.000      100.000